---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ExtrudedWallDisallowedForCrossSectionType
source: html/d064f104-5825-013b-f76c-3947e67b0bd5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ExtrudedWallDisallowedForCrossSectionType Property

Edited profiles are not allowed for this wall's cross-section type.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtrudedWallDisallowedForCrossSectionType { get; }
```